###print("heello cooding pytdon")
###print("안녕하세요")



# 표현식(expression)
#어떤 값을 만들어내는 코드

#리터럴(literal)

#1o
#20
#30

#식별자(identifier)
# π = 3.141592
# 기호를 빌려서 값을 표현!

#파이썬 자체가 강제하는 규칙
# 1. 키워드를 사용하면 안 된다
# 2. 특수문자를 _만 허용된다
# 3, 숫자로 시작하면 안 된다
# 4. 공백을 포함할 수 없다


# 개발들끼리 약속한 규칙(왠만하면 영어로 쓰자)

# 입력 = input = 10
# 출력 = output = 20 

#연산자(operator)
# + - * / %
# ** //
# and or not in 

# 키워드(keyword)
# 파이썬이 만들어질 때 정의된 특별한 의미를 갖는 단어 

# False
# None
# raise
# or

#---------------------------------------------------------

# 스네이크케이스와 캐멀케이스 사용자

# 스네이크 케이스 

# sendt to user

# 공백을 _(언더바)로 교체
# ➢send_to_user


# 캐멀케이스

# sendt to user

# 대문자로 변경한 후 결합
# ➢SendTOUser

# 두 번째 단어부터는 대문자로 변경하고 결합
# ➢ sendToUSer
# ➢ 파이썬에서는 사용하지 않음

# 한 글자 단어 구분

# animal: 스네이크 케이스
# Animal: 캐멀 케이스



74쪽 문제
1.함수
2.함수
3.함수 
4.함수
5.함수
